[NoCoverage] StringLiteral
Git/badge-roll/src/cli.ts:11:12
 const program = new Command();
 
 program
-  .command("affix")
+  .command("")
   .description("Affix badges to the target file")
   .action(() => {

[NoCoverage] BlockStatement
Git/badge-roll/src/cli.ts:13:17
 program
   .command("affix")
   .description("Affix badges to the target file")
-  .action(() => {
-    log("Affixing badges...");
-    affixCmd();
-    log("Done!");
-  });
+  .action(() => {});
 
 program

[NoCoverage] StringLiteral
Git/badge-roll/src/cli.ts:20:12
   });
 
 program
-  .command("check")
+  .command("")
   .description("Check whether badges in target file match config")
   .action(() => {

[NoCoverage] BlockStatement
Git/badge-roll/src/cli.ts:22:17
 program
   .command("check")
   .description("Check whether badges in target file match config")
-  .action(() => {
-    log("Checking badges...");
-    checkCmd();
-  });
+  .action(() => {});
 
 program

[NoCoverage] StringLiteral
Git/badge-roll/src/cli.ts:28:12
   });
 
 program
-  .command("load-config")
+  .command("")
   .description("Check whether badges in target file match config")
   .action(() => {

[NoCoverage] StringLiteral
Git/badge-roll/src/cli.ts:29:16
 
 program
   .command("load-config")
-  .description("Check whether badges in target file match config")
+  .description("")
   .action(() => {
     log("Loading config...");

[NoCoverage] BlockStatement
Git/badge-roll/src/cli.ts:30:17
 program
   .command("load-config")
   .description("Check whether badges in target file match config")
-  .action(() => {
-    log("Loading config...");
-    const config = loadConfigCmd();
-    log(config);
-  });
+  .action(() => {});
 
 program.parse(process.argv);
