[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-affixer.ts:17:7
   separator: string,
   position: string
 ): string {
-  if (!positions[position]) throw new Error(`Unknown position ${position}`);
+  if (false) throw new Error(`Unknown position ${position}`);
 
   const processor = unified().use(markdown);

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-affixer.ts:17:7
   separator: string,
   position: string
 ): string {
-  if (!positions[position]) throw new Error(`Unknown position ${position}`);
+  if (true) throw new Error(`Unknown position ${position}`);
 
   const processor = unified().use(markdown);

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-affixer.ts:23:7
   const tree = nav.parents(processor.parse(doc));
   const anchor: Node = positions[position].findAnchor(tree);
 
-  if (!anchor) throw new Error("Couldn't find anchor in target file");
+  if (true) throw new Error("Couldn't find anchor in target file");
 
   const badgeSectionLocation = findBadgeSection(

[Survived] BooleanLiteral
src/contributions/printer-markdown/badge-affixer.ts:23:7
   const tree = nav.parents(processor.parse(doc));
   const anchor: Node = positions[position].findAnchor(tree);
 
-  if (!anchor) throw new Error("Couldn't find anchor in target file");
+  if (anchor) throw new Error("Couldn't find anchor in target file");
 
   const badgeSectionLocation = findBadgeSection(
