[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:16:7
 ): Location {
   const starter = nav.find(tree, startingNode);
 
-  if (starter) {
+  if (false) {
     const state = new BadgeFinderState(starter, starter.parent);
 

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:16:7
 ): Location {
   const starter = nav.find(tree, startingNode);
 
-  if (starter) {
+  if (true) {
     const state = new BadgeFinderState(starter, starter.parent);
 

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:19:12
   if (starter) {
     const state = new BadgeFinderState(starter, starter.parent);
 
-    while (!state.searchComplete) {
+    while (false) {
       const currentNode = new NodeAnalysis(state.currentNode, separator);
       const nextNode = new NodeAnalysis(state.nextNode, separator);

[Survived] BooleanLiteral
src/contributions/printer-markdown/badge-finder.ts:19:12
   if (starter) {
     const state = new BadgeFinderState(starter, starter.parent);
 
-    while (!state.searchComplete) {
+    while (state.searchComplete) {
       const currentNode = new NodeAnalysis(state.currentNode, separator);
       const nextNode = new NodeAnalysis(state.nextNode, separator);

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:23:11
       const currentNode = new NodeAnalysis(state.currentNode, separator);
       const nextNode = new NodeAnalysis(state.nextNode, separator);
 
-      if (currentNode.isBadge) state.rememberBadge();
+      if (true) state.rememberBadge();
 
       if (currentNode.isRoot) {

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:23:11
       const currentNode = new NodeAnalysis(state.currentNode, separator);
       const nextNode = new NodeAnalysis(state.nextNode, separator);
 
-      if (currentNode.isBadge) state.rememberBadge();
+      if (false) state.rememberBadge();
 
       if (currentNode.isRoot) {

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:25:11
 
       if (currentNode.isBadge) state.rememberBadge();
 
-      if (currentNode.isRoot) {
+      if (true) {
         state.stepDown();
       } else if (

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:25:11
 
       if (currentNode.isBadge) state.rememberBadge();
 
-      if (currentNode.isRoot) {
+      if (false) {
         state.stepDown();
       } else if (

[Survived] LogicalOperator
src/contributions/printer-markdown/badge-finder.ts:28:9
       if (currentNode.isRoot) {
         state.stepDown();
       } else if (
-        currentNode.isParagraph &&
-        position === "below-lead" &&
+        currentNode.isParagraph || position === "below-lead" &&
         state.paragraphCount === 0
       ) {

[Survived] LogicalOperator
src/contributions/printer-markdown/badge-finder.ts:28:9
       if (currentNode.isRoot) {
         state.stepDown();
       } else if (
-        currentNode.isParagraph &&
-        position === "below-lead" &&
-        state.paragraphCount === 0
+        currentNode.isParagraph && position === "below-lead" || state.paragraphCount === 0
       ) {
         state.countParagraph();

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:29:9
         state.stepDown();
       } else if (
         currentNode.isParagraph &&
-        position === "below-lead" &&
+        false &&
         state.paragraphCount === 0
       ) {

[Survived] EqualityOperator
src/contributions/printer-markdown/badge-finder.ts:29:9
         state.stepDown();
       } else if (
         currentNode.isParagraph &&
-        position === "below-lead" &&
+        position !== "below-lead" &&
         state.paragraphCount === 0
       ) {

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:30:9
       } else if (
         currentNode.isParagraph &&
         position === "below-lead" &&
-        state.paragraphCount === 0
+        true
       ) {
         state.countParagraph();

[Survived] EqualityOperator
src/contributions/printer-markdown/badge-finder.ts:30:9
       } else if (
         currentNode.isParagraph &&
         position === "below-lead" &&
-        state.paragraphCount === 0
+        state.paragraphCount !== 0
       ) {
         state.countParagraph();

[Survived] BlockStatement
src/contributions/printer-markdown/badge-finder.ts:31:9
         currentNode.isParagraph &&
         position === "below-lead" &&
         state.paragraphCount === 0
-      ) {
-        state.countParagraph();
-        state.stepForward();
-      } else if (currentNode.isParagraph) {
+      ) {} else if (currentNode.isParagraph) {
         state.countParagraph();
         state.stepDown();

[Survived] BlockStatement
src/contributions/printer-markdown/badge-finder.ts:34:43
       ) {
         state.countParagraph();
         state.stepForward();
-      } else if (currentNode.isParagraph) {
-        state.countParagraph();
-        state.stepDown();
-      } else if (!nextNode.exists) state.complete();
+      } else if (currentNode.isParagraph) {} else if (!nextNode.exists) state.complete();
       else if (nextNode.isParagraph) state.stepForward();
       else if (nextNode.isBadge) state.stepForward();

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:34:18
       ) {
         state.countParagraph();
         state.stepForward();
-      } else if (currentNode.isParagraph) {
+      } else if (false) {
         state.countParagraph();
         state.stepDown();

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:37:18
       } else if (currentNode.isParagraph) {
         state.countParagraph();
         state.stepDown();
-      } else if (!nextNode.exists) state.complete();
+      } else if (false) state.complete();
       else if (nextNode.isParagraph) state.stepForward();
       else if (nextNode.isBadge) state.stepForward();

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:37:18
       } else if (currentNode.isParagraph) {
         state.countParagraph();
         state.stepDown();
-      } else if (!nextNode.exists) state.complete();
+      } else if (true) state.complete();
       else if (nextNode.isParagraph) state.stepForward();
       else if (nextNode.isBadge) state.stepForward();

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:38:16
         state.countParagraph();
         state.stepDown();
       } else if (!nextNode.exists) state.complete();
-      else if (nextNode.isParagraph) state.stepForward();
+      else if (false) state.stepForward();
       else if (nextNode.isBadge) state.stepForward();
       else if (nextNode.isSpace || nextNode.isSeparator || nextNode.isNewline)

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:38:16
         state.countParagraph();
         state.stepDown();
       } else if (!nextNode.exists) state.complete();
-      else if (nextNode.isParagraph) state.stepForward();
+      else if (true) state.stepForward();
       else if (nextNode.isBadge) state.stepForward();
       else if (nextNode.isSpace || nextNode.isSeparator || nextNode.isNewline)

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:39:16
         state.stepDown();
       } else if (!nextNode.exists) state.complete();
       else if (nextNode.isParagraph) state.stepForward();
-      else if (nextNode.isBadge) state.stepForward();
+      else if (false) state.stepForward();
       else if (nextNode.isSpace || nextNode.isSeparator || nextNode.isNewline)
         state.stepForward();

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:39:16
         state.stepDown();
       } else if (!nextNode.exists) state.complete();
       else if (nextNode.isParagraph) state.stepForward();
-      else if (nextNode.isBadge) state.stepForward();
+      else if (true) state.stepForward();
       else if (nextNode.isSpace || nextNode.isSeparator || nextNode.isNewline)
         state.stepForward();

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:40:16
       } else if (!nextNode.exists) state.complete();
       else if (nextNode.isParagraph) state.stepForward();
       else if (nextNode.isBadge) state.stepForward();
-      else if (nextNode.isSpace || nextNode.isSeparator || nextNode.isNewline)
+      else if (false)
         state.stepForward();
       else state.complete();

[Survived] ConditionalExpression
src/contributions/printer-markdown/badge-finder.ts:40:16
       } else if (!nextNode.exists) state.complete();
       else if (nextNode.isParagraph) state.stepForward();
       else if (nextNode.isBadge) state.stepForward();
-      else if (nextNode.isSpace || nextNode.isSeparator || nextNode.isNewline)
+      else if (false || nextNode.isNewline)
         state.stepForward();
       else state.complete();

[Survived] ObjectLiteral
src/contributions/printer-markdown/badge-finder.ts:48:12
     const badgeSectionStart = nav.position(state.firstBadge).start.offset;
     const badgeSectionEnd = nav.position(state.lastBadge).end.offset;
 
-    return {
-      start: badgeSectionStart,
-      end: badgeSectionEnd,
-    };
+    return {};
   } else {
     return null;

[NoCoverage] BlockStatement
src/contributions/printer-markdown/badge-finder.ts:52:10
       start: badgeSectionStart,
       end: badgeSectionEnd,
     };
-  } else {
-    return null;
-  }
+  } else {}
 }
 
