[NoCoverage] BlockStatement
src/contributions/printer-markdown/index.ts:11:15
       badgeSection: Array<Badge>,
       settings: Settings,
       target?: string
-    ): string {
-      return processMarkdown(badgeSection, settings, target);
-    },
+    ): string {},
     markdown: function (
       badgeSection: Array<Badge>,
