[Survived] ObjectLiteral
src/contributions/printer-markdown/positions.ts:8:17
 
 import { Positions } from "./types";
 
-const anchors = {
-  h1: {
-    type: "heading",
-    depth: 1,
-  },
-  h2: {
-    type: "heading",
-    depth: 2,
-  },
-  root: {
-    type: "root",
-  },
-};
+const anchors = {};
 
 const br = "\n\n";

[Survived] ObjectLiteral
src/contributions/printer-markdown/positions.ts:9:7
 import { Positions } from "./types";
 
 const anchors = {
-  h1: {
-    type: "heading",
-    depth: 1,
-  },
+  h1: {},
   h2: {
     type: "heading",

[Survived] ObjectLiteral
src/contributions/printer-markdown/positions.ts:13:7
     type: "heading",
     depth: 1,
   },
-  h2: {
-    type: "heading",
-    depth: 2,
-  },
+  h2: {},
   root: {
     type: "root",

[Survived] StringLiteral
src/contributions/printer-markdown/positions.ts:18:11
     depth: 2,
   },
   root: {
-    type: "root",
+    type: "",
   },
 };

[Survived] StringLiteral
src/contributions/printer-markdown/positions.ts:22:12
   },
 };
 
-const br = "\n\n";
+const br = "";
 
 export const positions: Positions = {

[Survived] ArrowFunction
src/contributions/printer-markdown/positions.ts:27:17
 export const positions: Positions = {
   top: {
     relation: "below",
-    findAnchor: (tree) => nav.find(tree, anchors.root),
+    findAnchor: () => undefined,
     affix: (source, badges, anchorLoc, badgesLoc) => {
       if (badgesLoc.end) {

[Survived] BlockStatement
src/contributions/printer-markdown/positions.ts:28:54
   top: {
     relation: "below",
     findAnchor: (tree) => nav.find(tree, anchors.root),
-    affix: (source, badges, anchorLoc, badgesLoc) => {
-      if (badgesLoc.end) {
-        const tail = after(badgesLoc.end).in(source);
-        return concat(badges, tail);
-      } else return concat(badges, br, source);
-    },
+    affix: (source, badges, anchorLoc, badgesLoc) => {},
   },
   "above-title": {

[Survived] ConditionalExpression
src/contributions/printer-markdown/positions.ts:29:11
     relation: "below",
     findAnchor: (tree) => nav.find(tree, anchors.root),
     affix: (source, badges, anchorLoc, badgesLoc) => {
-      if (badgesLoc.end) {
+      if (true) {
         const tail = after(badgesLoc.end).in(source);
         return concat(badges, tail);

[Survived] BlockStatement
src/contributions/printer-markdown/positions.ts:29:26
     relation: "below",
     findAnchor: (tree) => nav.find(tree, anchors.root),
     affix: (source, badges, anchorLoc, badgesLoc) => {
-      if (badgesLoc.end) {
-        const tail = after(badgesLoc.end).in(source);
-        return concat(badges, tail);
-      } else return concat(badges, br, source);
+      if (badgesLoc.end) {} else return concat(badges, br, source);
     },
   },

[Survived] ObjectLiteral
src/contributions/printer-markdown/positions.ts:35:18
       } else return concat(badges, br, source);
     },
   },
-  "above-title": {
-    relation: "above",
-    findAnchor: (tree) => nav.find(tree, anchors.h1),
-    affix: (source, badges, anchorLoc, badgesLoc) => "Placeholder",
-  },
+  "above-title": {},
   "below-title": {
     relation: "below",

[Survived] ArrowFunction
src/contributions/printer-markdown/positions.ts:37:17
   },
   "above-title": {
     relation: "above",
-    findAnchor: (tree) => nav.find(tree, anchors.h1),
+    findAnchor: () => undefined,
     affix: (source, badges, anchorLoc, badgesLoc) => "Placeholder",
   },

[Survived] ArrowFunction
src/contributions/printer-markdown/positions.ts:38:12
   "above-title": {
     relation: "above",
     findAnchor: (tree) => nav.find(tree, anchors.h1),
-    affix: (source, badges, anchorLoc, badgesLoc) => "Placeholder",
+    affix: () => undefined,
   },
   "below-title": {

[Survived] ObjectLiteral
src/contributions/printer-markdown/positions.ts:40:18
     findAnchor: (tree) => nav.find(tree, anchors.h1),
     affix: (source, badges, anchorLoc, badgesLoc) => "Placeholder",
   },
-  "below-title": {
-    relation: "below",
-    findAnchor: (tree) => nav.find(tree, anchors.h1),
-    affix: (source, badges, anchorLoc, badgesLoc) => {
-      const head = before(anchorLoc.end).in(source);
-      const tail = after(badgesLoc.end || anchorLoc.end).in(source);
-      return concat(head, br, badges, tail);
-    },
-  },
+  "below-title": {},
   "below-lead": {
     relation: "below",

[Survived] ArrowFunction
src/contributions/printer-markdown/positions.ts:42:17
   },
   "below-title": {
     relation: "below",
-    findAnchor: (tree) => nav.find(tree, anchors.h1),
+    findAnchor: () => undefined,
     affix: (source, badges, anchorLoc, badgesLoc) => {
       const head = before(anchorLoc.end).in(source);

[Survived] BlockStatement
src/contributions/printer-markdown/positions.ts:43:54
   "below-title": {
     relation: "below",
     findAnchor: (tree) => nav.find(tree, anchors.h1),
-    affix: (source, badges, anchorLoc, badgesLoc) => {
-      const head = before(anchorLoc.end).in(source);
-      const tail = after(badgesLoc.end || anchorLoc.end).in(source);
-      return concat(head, br, badges, tail);
-    },
+    affix: (source, badges, anchorLoc, badgesLoc) => {},
   },
   "below-lead": {

[Survived] LogicalOperator
src/contributions/printer-markdown/positions.ts:45:26
     findAnchor: (tree) => nav.find(tree, anchors.h1),
     affix: (source, badges, anchorLoc, badgesLoc) => {
       const head = before(anchorLoc.end).in(source);
-      const tail = after(badgesLoc.end || anchorLoc.end).in(source);
+      const tail = after(badgesLoc.end && anchorLoc.end).in(source);
       return concat(head, br, badges, tail);
     },

[Survived] ConditionalExpression
src/contributions/printer-markdown/positions.ts:45:26
     findAnchor: (tree) => nav.find(tree, anchors.h1),
     affix: (source, badges, anchorLoc, badgesLoc) => {
       const head = before(anchorLoc.end).in(source);
-      const tail = after(badgesLoc.end || anchorLoc.end).in(source);
+      const tail = after(false).in(source);
       return concat(head, br, badges, tail);
     },

[Survived] ObjectLiteral
src/contributions/printer-markdown/positions.ts:49:17
       return concat(head, br, badges, tail);
     },
   },
-  "below-lead": {
-    relation: "below",
-    findAnchor: (tree) => {
-      const h1 = nav.find(tree, anchors.h1);
-      const lead = nav.findAfter(h1.parent, h1, "paragraph");
-      return lead;
-    },
-    affix: (source, badges, anchorLoc, badgesLoc) => {
-      const head = before(anchorLoc.end).in(source);
-      const tail = after(badgesLoc.end || anchorLoc.end).in(source);
-      return concat(head, br, badges, tail);
-    },
-  },
+  "below-lead": {},
   "below-intro": {
     relation: "above",

[Survived] BlockStatement
src/contributions/printer-markdown/positions.ts:51:27
   },
   "below-lead": {
     relation: "below",
-    findAnchor: (tree) => {
-      const h1 = nav.find(tree, anchors.h1);
-      const lead = nav.findAfter(h1.parent, h1, "paragraph");
-      return lead;
-    },
+    findAnchor: (tree) => {},
     affix: (source, badges, anchorLoc, badgesLoc) => {
       const head = before(anchorLoc.end).in(source);

[Survived] StringLiteral
src/contributions/printer-markdown/positions.ts:53:49
     relation: "below",
     findAnchor: (tree) => {
       const h1 = nav.find(tree, anchors.h1);
-      const lead = nav.findAfter(h1.parent, h1, "paragraph");
+      const lead = nav.findAfter(h1.parent, h1, "");
       return lead;
     },

[Survived] BlockStatement
src/contributions/printer-markdown/positions.ts:56:54
       const lead = nav.findAfter(h1.parent, h1, "paragraph");
       return lead;
     },
-    affix: (source, badges, anchorLoc, badgesLoc) => {
-      const head = before(anchorLoc.end).in(source);
-      const tail = after(badgesLoc.end || anchorLoc.end).in(source);
-      return concat(head, br, badges, tail);
-    },
+    affix: (source, badges, anchorLoc, badgesLoc) => {},
   },
   "below-intro": {

[Survived] ConditionalExpression
src/contributions/printer-markdown/positions.ts:58:26
     },
     affix: (source, badges, anchorLoc, badgesLoc) => {
       const head = before(anchorLoc.end).in(source);
-      const tail = after(badgesLoc.end || anchorLoc.end).in(source);
+      const tail = after(true).in(source);
       return concat(head, br, badges, tail);
     },

[NoCoverage] BlockStatement
src/contributions/printer-markdown/positions.ts:64:27
   },
   "below-intro": {
     relation: "above",
-    findAnchor: (tree) => {
-      const h2 = nav.find(tree, anchors.h2);
-      const introEnd = nav.findBefore(h2.parent, h2, "paragraph");
-      return introEnd;
-    },
+    findAnchor: (tree) => {},
     affix: (source, badges, anchorLoc, badgesLoc) => "Placeholder",
   },

[NoCoverage] StringLiteral
src/contributions/printer-markdown/positions.ts:66:54
     relation: "above",
     findAnchor: (tree) => {
       const h2 = nav.find(tree, anchors.h2);
-      const introEnd = nav.findBefore(h2.parent, h2, "paragraph");
+      const introEnd = nav.findBefore(h2.parent, h2, "");
       return introEnd;
     },

[Survived] ArrowFunction
src/contributions/printer-markdown/positions.ts:69:12
       const introEnd = nav.findBefore(h2.parent, h2, "paragraph");
       return introEnd;
     },
-    affix: (source, badges, anchorLoc, badgesLoc) => "Placeholder",
+    affix: () => undefined,
   },
   section: {

[Survived] ArrowFunction
src/contributions/printer-markdown/positions.ts:73:17
   },
   section: {
     relation: "inside",
-    findAnchor: (tree) => nav.select("[class=badges]", tree),
+    findAnchor: () => undefined,
     affix: (source, badges, anchorLoc, badgesLoc) => {
       const head = before(anchorLoc.start).in(source);

[NoCoverage] StringLiteral
src/contributions/printer-markdown/positions.ts:73:38
   },
   section: {
     relation: "inside",
-    findAnchor: (tree) => nav.select("[class=badges]", tree),
+    findAnchor: (tree) => nav.select("", tree),
     affix: (source, badges, anchorLoc, badgesLoc) => {
       const head = before(anchorLoc.start).in(source);

[NoCoverage] BlockStatement
src/contributions/printer-markdown/positions.ts:74:54
   section: {
     relation: "inside",
     findAnchor: (tree) => nav.select("[class=badges]", tree),
-    affix: (source, badges, anchorLoc, badgesLoc) => {
-      const head = before(anchorLoc.start).in(source);
-      const tail = after(anchorLoc.end).in(source);
-      return concat(head, br, badges, tail);
-    },
+    affix: (source, badges, anchorLoc, badgesLoc) => {},
   },
   current: {

[Survived] ArrowFunction
src/contributions/printer-markdown/positions.ts:82:17
   },
   current: {
     relation: "inside",
-    findAnchor: (tree) => nav.find(tree, test.isBadge),
+    findAnchor: () => undefined,
     affix: (source, badges, anchorLoc, badgesLoc) => {
       if (!badgesLoc.start || !badgesLoc.end)

[Survived] BlockStatement
src/contributions/printer-markdown/positions.ts:83:54
   current: {
     relation: "inside",
     findAnchor: (tree) => nav.find(tree, test.isBadge),
-    affix: (source, badges, anchorLoc, badgesLoc) => {
-      if (!badgesLoc.start || !badgesLoc.end)
-        throw new Error(
-          "Badge section position was set to `current`, but no badges were found in current target file."
-        );
-      const head = before(badgesLoc.start).in(source);
-      const tail = after(badgesLoc.end).in(source);
-      return concat(head, badges, tail);
-    },
+    affix: (source, badges, anchorLoc, badgesLoc) => {},
   },
 };

[Survived] ConditionalExpression
src/contributions/printer-markdown/positions.ts:84:11
     relation: "inside",
     findAnchor: (tree) => nav.find(tree, test.isBadge),
     affix: (source, badges, anchorLoc, badgesLoc) => {
-      if (!badgesLoc.start || !badgesLoc.end)
+      if (false)
         throw new Error(
           "Badge section position was set to `current`, but no badges were found in current target file."

[Survived] BooleanLiteral
src/contributions/printer-markdown/positions.ts:84:31
     relation: "inside",
     findAnchor: (tree) => nav.find(tree, test.isBadge),
     affix: (source, badges, anchorLoc, badgesLoc) => {
-      if (!badgesLoc.start || !badgesLoc.end)
+      if (!badgesLoc.start || badgesLoc.end)
         throw new Error(
           "Badge section position was set to `current`, but no badges were found in current target file."

[NoCoverage] StringLiteral
src/contributions/printer-markdown/positions.ts:86:11
     affix: (source, badges, anchorLoc, badgesLoc) => {
       if (!badgesLoc.start || !badgesLoc.end)
         throw new Error(
-          "Badge section position was set to `current`, but no badges were found in current target file."
+          ""
         );
       const head = before(badgesLoc.start).in(source);
