[Survived] BlockStatement
src/contributions/printer-markdown/utils.ts:5:49
 
 import { Node } from "unist";
 
-export function getFirstChild(node: Node): Node {
-  const firstChild: Node = nav.select(":first-child", node);
-  return firstChild ? firstChild : null;
-}
+export function getFirstChild(node: Node): Node {}
 export function getFirstGrandchildren(node: Node): Array<Node> {
   const firstChild: Node = getFirstChild(node);

[NoCoverage] BlockStatement
src/contributions/printer-markdown/utils.ts:9:64
   const firstChild: Node = nav.select(":first-child", node);
   return firstChild ? firstChild : null;
 }
-export function getFirstGrandchildren(node: Node): Array<Node> {
-  const firstChild: Node = getFirstChild(node);
-  const grandchildren: Array<Node> = firstChild
-    ? [].concat(firstChild.children)
-    : [];
-  return grandchildren;
-}
+export function getFirstGrandchildren(node: Node): Array<Node> {}
 
 export function removeTrailingNewLine(markup: string): string {

[NoCoverage] ArrayDeclaration
src/contributions/printer-markdown/utils.ts:12:7
 export function getFirstGrandchildren(node: Node): Array<Node> {
   const firstChild: Node = getFirstChild(node);
   const grandchildren: Array<Node> = firstChild
-    ? [].concat(firstChild.children)
+    ? ["Stryker was here"].concat(firstChild.children)
     : [];
   return grandchildren;

[NoCoverage] ArrayDeclaration
src/contributions/printer-markdown/utils.ts:13:7
   const firstChild: Node = getFirstChild(node);
   const grandchildren: Array<Node> = firstChild
     ? [].concat(firstChild.children)
-    : [];
+    : ["Stryker was here"];
   return grandchildren;
 }

[Survived] BlockStatement
src/contributions/printer-markdown/utils.ts:17:63
   return grandchildren;
 }
 
-export function removeTrailingNewLine(markup: string): string {
-  const trailingNewlinePattern = /^([^]*?)\n*$/s;
-  if (markup.match(trailingNewlinePattern)) {
-    const markupWithOutTrailingNewLine = markup.match(
-      trailingNewlinePattern
-    )[1];
-    return markupWithOutTrailingNewLine;
-  } else {
-    return markup;
-  }
-}
+export function removeTrailingNewLine(markup: string): string {}
 
 export function concat(first: string, ...rest: Array<string>): string {

[Survived] ConditionalExpression
src/contributions/printer-markdown/utils.ts:19:7
 
 export function removeTrailingNewLine(markup: string): string {
   const trailingNewlinePattern = /^([^]*?)\n*$/s;
-  if (markup.match(trailingNewlinePattern)) {
+  if (false) {
     const markupWithOutTrailingNewLine = markup.match(
       trailingNewlinePattern

[Survived] BlockStatement
src/contributions/printer-markdown/utils.ts:19:45
 
 export function removeTrailingNewLine(markup: string): string {
   const trailingNewlinePattern = /^([^]*?)\n*$/s;
-  if (markup.match(trailingNewlinePattern)) {
-    const markupWithOutTrailingNewLine = markup.match(
-      trailingNewlinePattern
-    )[1];
-    return markupWithOutTrailingNewLine;
-  } else {
+  if (markup.match(trailingNewlinePattern)) {} else {
     return markup;
   }

[NoCoverage] BlockStatement
src/contributions/printer-markdown/utils.ts:24:10
       trailingNewlinePattern
     )[1];
     return markupWithOutTrailingNewLine;
-  } else {
-    return markup;
-  }
+  } else {}
 }
 

[Survived] BlockStatement
src/contributions/printer-markdown/utils.ts:29:71
   }
 }
 
-export function concat(first: string, ...rest: Array<string>): string {
-  return first.concat(...rest);
-}
+export function concat(first: string, ...rest: Array<string>): string {}
 
 export function before(endingOffset: number): { in: (doc: string) => string } {

[Survived] BlockStatement
src/contributions/printer-markdown/utils.ts:33:79
   return first.concat(...rest);
 }
 
-export function before(endingOffset: number): { in: (doc: string) => string } {
-  return {
-    in: (document: string): string => {
-      return document.substring(0, endingOffset);
-    },
-  };
-}
+export function before(endingOffset: number): { in: (doc: string) => string } {}
 
 export function after(

[Survived] BlockStatement
src/contributions/printer-markdown/utils.ts:35:39
 
 export function before(endingOffset: number): { in: (doc: string) => string } {
   return {
-    in: (document: string): string => {
-      return document.substring(0, endingOffset);
-    },
+    in: (document: string): string => {},
   };
 }

[Survived] BlockStatement
src/contributions/printer-markdown/utils.ts:43:36
 
 export function after(
   beginningOffset: number
-): { in: (doc: string) => string } {
-  return {
-    in: (document: string): string => {
-      return document.substring(beginningOffset);
-    },
-  };
-}
+): { in: (doc: string) => string } {}
 

[Survived] BlockStatement
src/contributions/printer-markdown/utils.ts:45:39
   beginningOffset: number
 ): { in: (doc: string) => string } {
   return {
-    in: (document: string): string => {
-      return document.substring(beginningOffset);
-    },
+    in: (document: string): string => {},
   };
 }
