[Killed] BlockStatement
badge-roll/src/core/affix.ts:4:64
 import { Config, Run } from "../types";
 import { writeFile } from "../utilities";
 
-export function affix(source: string, config?: Config): string {
-  const run = new Run(source, config);
-  const modified = run.modified;
-  return modified;
-}
+export function affix(source: string, config?: Config): string {}
 
 export function affixCmd(): void {

[NoCoverage] BlockStatement
badge-roll/src/core/affix.ts:10:34
   return modified;
 }
 
-export function affixCmd(): void {
-  const run = new Run();
-  const modified = run.modified;
-  writeFile(run.filePath, modified);
-}
+export function affixCmd(): void {}
 
