[Killed] BlockStatement
badge-roll/src/core/check.ts:3:65
 import { Config, Run } from "../types";
 
-export function check(source: string, config?: Config): boolean {
-  const run = new Run(source, config);
-  const matches = run.matches;
-  return matches;
-}
+export function check(source: string, config?: Config): boolean {}
 
 export function checkCmd(): void {

[NoCoverage] BlockStatement
badge-roll/src/core/check.ts:9:34
   return matches;
 }
 
-export function checkCmd(): void {
-  const run = new Run();
-  const matches = run.matches;
-
-  if (matches) console.log("Target file badges matched config!");
-  else {
-    console.error(
-      "Target file badges did not match config. Run `badge-roll affix` to fix."
-    );
-    process.exitCode = 1;
-  }
-}
+export function checkCmd(): void {}
 

[NoCoverage] ConditionalExpression
badge-roll/src/core/check.ts:13:7
   const run = new Run();
   const matches = run.matches;
 
-  if (matches) console.log("Target file badges matched config!");
+  if (false) console.log("Target file badges matched config!");
   else {
     console.error(

[NoCoverage] ConditionalExpression
badge-roll/src/core/check.ts:13:7
   const run = new Run();
   const matches = run.matches;
 
-  if (matches) console.log("Target file badges matched config!");
+  if (true) console.log("Target file badges matched config!");
   else {
     console.error(

[NoCoverage] BlockStatement
badge-roll/src/core/check.ts:14:8
   const matches = run.matches;
 
   if (matches) console.log("Target file badges matched config!");
-  else {
-    console.error(
-      "Target file badges did not match config. Run `badge-roll affix` to fix."
-    );
-    process.exitCode = 1;
-  }
+  else {}
 }
 
