[NoCoverage] BlockStatement
badge-roll/src/core/load-config.ts:3:41
 import { Config } from "../types";
 
-export function loadConfigCmd(): Config {
-  const config = new Config();
-  return config;
-}
+export function loadConfigCmd(): Config {}
 
