[Killed] BlockStatement
badge-roll/src/loaders/config-loader.ts:12:49
   searchPlaces: filePaths,
 });
 
-export function findConfig(): CosmiconfigResult {
-  const config = explorer.search();
-  return config;
-}
+export function findConfig(): CosmiconfigResult {}
 
 export function validateConfig(config: Config): unknown {

[Survived] BlockStatement
badge-roll/src/loaders/config-loader.ts:17:57
   return config;
 }
 
-export function validateConfig(config: Config): unknown {
-  const { error, value } = configSchema.validate(config);
-  if (error) {
-    throw error;
-  } else {
-    return value;
-  }
-}
+export function validateConfig(config: Config): unknown {}
 

[Killed] ConditionalExpression
badge-roll/src/loaders/config-loader.ts:19:7
 
 export function validateConfig(config: Config): unknown {
   const { error, value } = configSchema.validate(config);
-  if (error) {
+  if (true) {
     throw error;
   } else {

[Survived] ConditionalExpression
badge-roll/src/loaders/config-loader.ts:19:7
 
 export function validateConfig(config: Config): unknown {
   const { error, value } = configSchema.validate(config);
-  if (error) {
+  if (false) {
     throw error;
   } else {

[Survived] BlockStatement
badge-roll/src/loaders/config-loader.ts:21:10
   const { error, value } = configSchema.validate(config);
   if (error) {
     throw error;
-  } else {
-    return value;
-  }
+  } else {}
 }
 
