[NoCoverage] BlockStatement
badge-roll/src/loaders/target-loader.ts:6:57
 
 export function loadTarget(
   path: string
-): { content: string; path: string; extension: string } {
-  const content = readFile(path);
-  const extension = extractFileExtension(path);
-  return {
-    content: content,
-    path: path,
-    extension: extension,
-  };
-}
+): { content: string; path: string; extension: string } {}
 

[NoCoverage] ObjectLiteral
badge-roll/src/loaders/target-loader.ts:9:10
 ): { content: string; path: string; extension: string } {
   const content = readFile(path);
   const extension = extractFileExtension(path);
-  return {
-    content: content,
-    path: path,
-    extension: extension,
-  };
+  return {};
 }
 
