[Killed] BlockStatement
src/types/classes/printer.ts:9:57
     settings: SettingsData,
     target?: string
   ) => string;
-  constructor(printers: PrinterList, printerId: string) {
-    if (printers[printerId]) {
-      this.print = printers[printerId];
-    } else {
-      new Error("No printer found for ${printerId}.");
-    }
-  }
+  constructor(printers: PrinterList, printerId: string) {}
 }
 

[Killed] ConditionalExpression
src/types/classes/printer.ts:10:9
     target?: string
   ) => string;
   constructor(printers: PrinterList, printerId: string) {
-    if (printers[printerId]) {
+    if (false) {
       this.print = printers[printerId];
     } else {

[Killed] BlockStatement
src/types/classes/printer.ts:10:30
     target?: string
   ) => string;
   constructor(printers: PrinterList, printerId: string) {
-    if (printers[printerId]) {
-      this.print = printers[printerId];
-    } else {
+    if (printers[printerId]) {} else {
       new Error("No printer found for ${printerId}.");
     }

[NoCoverage] BlockStatement
src/types/classes/printer.ts:12:12
   constructor(printers: PrinterList, printerId: string) {
     if (printers[printerId]) {
       this.print = printers[printerId];
-    } else {
-      new Error("No printer found for ${printerId}.");
-    }
+    } else {}
   }
 }

[NoCoverage] StringLiteral
src/types/classes/printer.ts:13:17
     if (printers[printerId]) {
       this.print = printers[printerId];
     } else {
-      new Error("No printer found for ${printerId}.");
+      new Error("");
     }
   }
