[Killed] BlockStatement
src/types/classes/target.ts:12:52
   extension: string;
   printer: string;
 
-  constructor(settings: Settings, source?: string) {
-    if (source !== undefined) {
-      this.originalContent = source;
-      this.printer = settings.printer;
-    } else {
-      const target = loadTarget(settings.file);
-      this.originalContent = target.content;
-      this.path = target.path;
-      this.extension = target.extension;
-      this.printer = this.extension;
-    }
-  }
+  constructor(settings: Settings, source?: string) {}
 
   write(modifiedContent: string): void {

[Killed] ConditionalExpression
src/types/classes/target.ts:13:9
   printer: string;
 
   constructor(settings: Settings, source?: string) {
-    if (source !== undefined) {
+    if (false) {
       this.originalContent = source;
       this.printer = settings.printer;

[Killed] BlockStatement
src/types/classes/target.ts:13:31
   printer: string;
 
   constructor(settings: Settings, source?: string) {
-    if (source !== undefined) {
-      this.originalContent = source;
-      this.printer = settings.printer;
-    } else {
+    if (source !== undefined) {} else {
       const target = loadTarget(settings.file);
       this.originalContent = target.content;

[NoCoverage] BlockStatement
src/types/classes/target.ts:16:12
     if (source !== undefined) {
       this.originalContent = source;
       this.printer = settings.printer;
-    } else {
-      const target = loadTarget(settings.file);
-      this.originalContent = target.content;
-      this.path = target.path;
-      this.extension = target.extension;
-      this.printer = this.extension;
-    }
+    } else {}
   }
 

[NoCoverage] BlockStatement
src/types/classes/target.ts:25:40
     }
   }
 
-  write(modifiedContent: string): void {
-    writeFile(this.path, modifiedContent);
-    this.modifiedContent = modifiedContent;
-  }
+  write(modifiedContent: string): void {}
 }
 
