[NoCoverage] BlockStatement
badge-roll/src/utilities/extract-file-extension.ts:3:60
 import pathParser from "path";
 
-export function extractFileExtension(path: string): string {
-  return pathParser.extname(path).match(/^\.(.*)$/)[1];
-}
+export function extractFileExtension(path: string): string {}
 

[NoCoverage] Regex
badge-roll/src/utilities/extract-file-extension.ts:4:41
 import pathParser from "path";
 
 export function extractFileExtension(path: string): string {
-  return pathParser.extname(path).match(/^\.(.*)$/)[1];
+  return pathParser.extname(path).match(/^\.(.*)/)[1];
 }
 
