[Killed] BlockStatement
badge-roll/src/utilities/load-module.ts:4:71
 import { Plugin } from "../types";
 import { contributionsPath } from "../options";
 
-export function loadModule(name: string, isInternal: boolean): Plugin {
-  if (isInternal) {
-    return require(`${contributionsPath}/${name}`).default;
-  } else {
-    throw new Error("External plugins not yet supported.");
-  }
-}
+export function loadModule(name: string, isInternal: boolean): Plugin {}
 

[Killed] ConditionalExpression
badge-roll/src/utilities/load-module.ts:5:7
 import { contributionsPath } from "../options";
 
 export function loadModule(name: string, isInternal: boolean): Plugin {
-  if (isInternal) {
+  if (false) {
     return require(`${contributionsPath}/${name}`).default;
   } else {

[Killed] BlockStatement
badge-roll/src/utilities/load-module.ts:5:19
 import { contributionsPath } from "../options";
 
 export function loadModule(name: string, isInternal: boolean): Plugin {
-  if (isInternal) {
-    return require(`${contributionsPath}/${name}`).default;
-  } else {
+  if (isInternal) {} else {
     throw new Error("External plugins not yet supported.");
   }

[Killed] StringLiteral
badge-roll/src/utilities/load-module.ts:6:20
 
 export function loadModule(name: string, isInternal: boolean): Plugin {
   if (isInternal) {
-    return require(`${contributionsPath}/${name}`).default;
+    return require(``).default;
   } else {
     throw new Error("External plugins not yet supported.");

[NoCoverage] BlockStatement
badge-roll/src/utilities/load-module.ts:7:10
 export function loadModule(name: string, isInternal: boolean): Plugin {
   if (isInternal) {
     return require(`${contributionsPath}/${name}`).default;
-  } else {
-    throw new Error("External plugins not yet supported.");
-  }
+  } else {}
 }
 
