[NoCoverage] BlockStatement
badge-roll/src/utilities/read-file.ts:3:48
 import fs from "fs";
 
-export function readFile(path: string): string {
-  const file = fs.readFileSync(path, "utf8");
-  return file;
-}
+export function readFile(path: string): string {}
 
