[NoCoverage] BlockStatement
badge-roll/src/utilities/write-file.ts:3:64
 import fs from "fs";
 
-export function writeFile(path: string, content: string): void {
-  fs.writeFileSync(path, content, "utf8");
-}
+export function writeFile(path: string, content: string): void {}
 
