[Survived] ObjectLiteral
src/contributions/about-package/index.ts:3:16
 import { About, Context } from "../../types/";
 
-export default {
-  about: function (about: About, context: Context): About {
-    const packageName = context.package.name || null;
-    const packageHomepage = context.package.homepage || null;
-
-    about.packageName = packageName;
-    about.packageHomepage = packageHomepage;
-
-    return about;
-  },
-};
+export default {};
 

[Survived] BlockStatement
src/contributions/about-package/index.ts:4:59
 import { About, Context } from "../../types/";
 
 export default {
-  about: function (about: About, context: Context): About {
-    const packageName = context.package.name || null;
-    const packageHomepage = context.package.homepage || null;
-
-    about.packageName = packageName;
-    about.packageHomepage = packageHomepage;
-
-    return about;
-  },
+  about: function (about: About, context: Context): About {},
 };
 

[Survived] ConditionalExpression
src/contributions/about-package/index.ts:5:25
 
 export default {
   about: function (about: About, context: Context): About {
-    const packageName = context.package.name || null;
+    const packageName = false;
     const packageHomepage = context.package.homepage || null;
 

[Survived] ConditionalExpression
src/contributions/about-package/index.ts:5:25
 
 export default {
   about: function (about: About, context: Context): About {
-    const packageName = context.package.name || null;
+    const packageName = true;
     const packageHomepage = context.package.homepage || null;
 

[Survived] LogicalOperator
src/contributions/about-package/index.ts:6:29
 export default {
   about: function (about: About, context: Context): About {
     const packageName = context.package.name || null;
-    const packageHomepage = context.package.homepage || null;
+    const packageHomepage = context.package.homepage && null;
 
     about.packageName = packageName;

[Survived] ConditionalExpression
src/contributions/about-package/index.ts:6:29
 export default {
   about: function (about: About, context: Context): About {
     const packageName = context.package.name || null;
-    const packageHomepage = context.package.homepage || null;
+    const packageHomepage = false;
 
     about.packageName = packageName;
