[Survived] BlockStatement
src/contributions/about-registry/index.ts:4:59
 import { About, Context } from "../../types/";
 
 export default {
-  about: function (about: About, context: Context): About {
-    const isPublic = !context.package.private;
-
-    if (isPublic) {
-      const npmBaseUrl = "https://www.npmjs.com/package";
-      const packageName = about.packageName;
-      const packageRegistry = `${npmBaseUrl}/${packageName}`;
-      about.packageRegistry = packageRegistry;
-    }
-
-    return about;
-  },
+  about: function (about: About, context: Context): About {},
 };
 

[Survived] BooleanLiteral
src/contributions/about-registry/index.ts:5:22
 
 export default {
   about: function (about: About, context: Context): About {
-    const isPublic = !context.package.private;
+    const isPublic = context.package.private;
 
     if (isPublic) {

[Survived] ConditionalExpression
src/contributions/about-registry/index.ts:7:9
   about: function (about: About, context: Context): About {
     const isPublic = !context.package.private;
 
-    if (isPublic) {
+    if (true) {
       const npmBaseUrl = "https://www.npmjs.com/package";
       const packageName = about.packageName;

[Survived] ConditionalExpression
src/contributions/about-registry/index.ts:7:9
   about: function (about: About, context: Context): About {
     const isPublic = !context.package.private;
 
-    if (isPublic) {
+    if (false) {
       const npmBaseUrl = "https://www.npmjs.com/package";
       const packageName = about.packageName;
