[Survived] BlockStatement
src/contributions/about-repo/index.ts:7:59
 import { About, Context } from "../../types";
 
 export default {
-  about: function (about: About, context: Context): About {
-    const repoUrl = context.package.repository.url || null;
-    const parsedUrl = new parseUrl(repoUrl);
-    const repoHost = parsedUrl.hostname;
-
-    let repoName = "";
-    let repoOwner = "";
-
-    switch (repoHost) {
-      case "github.com":
-        const parsedGithubUrl = parseGithubUrl(repoUrl);
-        repoName = parsedGithubUrl.name;
-        repoOwner = parsedGithubUrl.owner;
-    }
-
-    about.repoHost = repoHost;
-    about.repoUrl = repoUrl;
-    about.repo = repoName;
-    about.user = repoOwner;
-
-    return about;
-  },
+  about: function (about: About, context: Context): About {},
 };
 

[Survived] ConditionalExpression
src/contributions/about-repo/index.ts:8:21
 
 export default {
   about: function (about: About, context: Context): About {
-    const repoUrl = context.package.repository.url || null;
+    const repoUrl = true;
     const parsedUrl = new parseUrl(repoUrl);
     const repoHost = parsedUrl.hostname;

[Survived] LogicalOperator
src/contributions/about-repo/index.ts:8:21
 
 export default {
   about: function (about: About, context: Context): About {
-    const repoUrl = context.package.repository.url || null;
+    const repoUrl = context.package.repository.url && null;
     const parsedUrl = new parseUrl(repoUrl);
     const repoHost = parsedUrl.hostname;

[Survived] StringLiteral
src/contributions/about-repo/index.ts:13:21
     const repoHost = parsedUrl.hostname;
 
     let repoName = "";
-    let repoOwner = "";
+    let repoOwner = "Stryker was here!";
 
     switch (repoHost) {

[Survived] ConditionalExpression
src/contributions/about-repo/index.ts:16:7
     let repoOwner = "";
 
     switch (repoHost) {
-      case "github.com":
-        const parsedGithubUrl = parseGithubUrl(repoUrl);
-        repoName = parsedGithubUrl.name;
-        repoOwner = parsedGithubUrl.owner;
+      case "github.com":
     }
 
