[Survived] BlockStatement
src/contributions/printer-markdown/markup-processor.ts:17:11
   badgeSection: Array<Badge>,
   settings: Settings,
   target?: string
-): string {
-  const separator = separators[settings.separator];
-  const badgeSectionAst = generateBadgeSectionAst(badgeSection, separator);
-  const markupWithNewLine = generateMarkdown(badgeSectionAst);
-  const markup = removeTrailingNewLine(markupWithNewLine);
-
-  if (target) {
-    const modifiedTarget = affixBadgeSection(
-      target,
-      markup,
-      separator,
-      settings.position
-    );
-    return modifiedTarget;
-  } else {
-    return markup;
-  }
-}
+): string {}
 
 function generateMarkdown(node: Node) {

[Survived] ConditionalExpression
src/contributions/printer-markdown/markup-processor.ts:23:7
   const markupWithNewLine = generateMarkdown(badgeSectionAst);
   const markup = removeTrailingNewLine(markupWithNewLine);
 
-  if (target) {
+  if (true) {
     const modifiedTarget = affixBadgeSection(
       target,

[Survived] BlockStatement
src/contributions/printer-markdown/markup-processor.ts:23:15
   const markupWithNewLine = generateMarkdown(badgeSectionAst);
   const markup = removeTrailingNewLine(markupWithNewLine);
 
-  if (target) {
-    const modifiedTarget = affixBadgeSection(
-      target,
-      markup,
-      separator,
-      settings.position
-    );
-    return modifiedTarget;
-  } else {
+  if (target) {} else {
     return markup;
   }

[Survived] BlockStatement
src/contributions/printer-markdown/markup-processor.ts:31:10
       settings.position
     );
     return modifiedTarget;
-  } else {
-    return markup;
-  }
+  } else {}
 }
 

[Survived] BlockStatement
src/contributions/printer-markdown/markup-processor.ts:36:39
   }
 }
 
-function generateMarkdown(node: Node) {
-  const generator = unified().use(stringify);
-  const generated = generator.stringify(node);
-  return generated;
-}
+function generateMarkdown(node: Node) {}
 
