[Survived] StringLiteral
src/contributions/printer-markdown/separators.ts:5:9
 
 export const separators: Separators = {
   newline: "\n",
-  none: "",
+  none: "Stryker was here!",
   space: " ",
 };
