[Survived] BlockStatement
src/contributions/printer-markdown/tree-generator.ts:7:47
 
 import { Badge } from "../../types";
 
-function generateBadgeAst(badge: Badge): Node {
-  const badgeAst = {
-    type: "link",
-    url: badge.to,
-    title: badge.display,
-    children: [
-      {
-        type: "image",
-        url: badge.url,
-        alt: badge.display,
-      },
-    ],
-  };
-  return badgeAst;
-}
+function generateBadgeAst(badge: Badge): Node {}
 
 export function generateBadgeSectionAst(

[Survived] ObjectLiteral
src/contributions/printer-markdown/tree-generator.ts:8:20
 import { Badge } from "../../types";
 
 function generateBadgeAst(badge: Badge): Node {
-  const badgeAst = {
-    type: "link",
-    url: badge.to,
-    title: badge.display,
-    children: [
-      {
-        type: "image",
-        url: badge.url,
-        alt: badge.display,
-      },
-    ],
-  };
+  const badgeAst = {};
   return badgeAst;
 }

[Survived] BlockStatement
src/contributions/printer-markdown/tree-generator.ts:37:8
     badge: Badge,
     index: number,
     badges: Array<Badge>
-  ) => {
-    const badgeAst = generateBadgeAst(badge);
-    if (isLast(index, badges)) {
-      return accumulator.concat(badgeAst);
-    } else {
-      return accumulator.concat([badgeAst, separatorAst]);
-    }
-  };
+  ) => {};
 
   const badgeSectionAst = {

[Survived] ConditionalExpression
src/contributions/printer-markdown/tree-generator.ts:39:9
     badges: Array<Badge>
   ) => {
     const badgeAst = generateBadgeAst(badge);
-    if (isLast(index, badges)) {
+    if (false) {
       return accumulator.concat(badgeAst);
     } else {

[Survived] BlockStatement
src/contributions/printer-markdown/tree-generator.ts:39:32
     badges: Array<Badge>
   ) => {
     const badgeAst = generateBadgeAst(badge);
-    if (isLast(index, badges)) {
-      return accumulator.concat(badgeAst);
-    } else {
+    if (isLast(index, badges)) {} else {
       return accumulator.concat([badgeAst, separatorAst]);
     }

[Survived] BlockStatement
src/contributions/printer-markdown/tree-generator.ts:41:12
     const badgeAst = generateBadgeAst(badge);
     if (isLast(index, badges)) {
       return accumulator.concat(badgeAst);
-    } else {
-      return accumulator.concat([badgeAst, separatorAst]);
-    }
+    } else {}
   };
 

[Survived] ArrayDeclaration
src/contributions/printer-markdown/tree-generator.ts:48:43
 
   const badgeSectionAst = {
     type: "paragraph",
-    children: badges.reduce(badgeReducer, []),
+    children: badges.reduce(badgeReducer, ["Stryker was here"]),
   };
   return badgeSectionAst;
