[Survived] BlockStatement
printer-markdown/types/classes/badge-finder-state.ts:18:51
   lastBadge: Node;
   paragraphCount: number;
   searchComplete: boolean;
-  constructor(starter: Node, starterParent: Node) {
-    this.previousNode = null;
-    this.currentNode = starter;
-    this.firstBadge = test.isBadge(starter) ? starter : null;
-    this.mostRecentBadge = this.firstBadge;
-    this.lastBadge = null;
-    this.currentParent = starterParent;
-    this.nextNode = starterParent
-      ? findAfter(this.currentParent, this.currentNode)
-      : null;
-    this.searchComplete = false;
-    this.paragraphCount = 0;
-  }
+  constructor(starter: Node, starterParent: Node) {}
   rememberBadge(): void {
     if (this.firstBadge === null) {

[Survived] BooleanLiteral
printer-markdown/types/classes/badge-finder-state.ts:28:27
     this.nextNode = starterParent
       ? findAfter(this.currentParent, this.currentNode)
       : null;
-    this.searchComplete = false;
+    this.searchComplete = true;
     this.paragraphCount = 0;
   }

[Survived] BlockStatement
printer-markdown/types/classes/badge-finder-state.ts:31:25
     this.searchComplete = false;
     this.paragraphCount = 0;
   }
-  rememberBadge(): void {
-    if (this.firstBadge === null) {
-      this.firstBadge = this.currentNode;
-    }
-    this.mostRecentBadge = this.currentNode;
-  }
+  rememberBadge(): void {}
   stepForward(): void {
     this.previousNode = this.currentNode;

[Survived] ConditionalExpression
printer-markdown/types/classes/badge-finder-state.ts:32:9
     this.paragraphCount = 0;
   }
   rememberBadge(): void {
-    if (this.firstBadge === null) {
+    if (false) {
       this.firstBadge = this.currentNode;
     }

[Survived] ConditionalExpression
printer-markdown/types/classes/badge-finder-state.ts:32:9
     this.paragraphCount = 0;
   }
   rememberBadge(): void {
-    if (this.firstBadge === null) {
+    if (true) {
       this.firstBadge = this.currentNode;
     }

[Survived] BlockStatement
printer-markdown/types/classes/badge-finder-state.ts:37:23
     }
     this.mostRecentBadge = this.currentNode;
   }
-  stepForward(): void {
-    this.previousNode = this.currentNode;
-    this.currentNode = this.nextNode;
-    this.nextNode = findAfter(this.currentParent, this.currentNode);
-  }
+  stepForward(): void {}
   stepDown(): void {
     this.previousNode = this.currentNode;

[Survived] BlockStatement
printer-markdown/types/classes/badge-finder-state.ts:42:20
     this.currentNode = this.nextNode;
     this.nextNode = findAfter(this.currentParent, this.currentNode);
   }
-  stepDown(): void {
-    this.previousNode = this.currentNode;
-    this.currentParent = this.previousNode;
-    this.currentNode = getFirstChild(this.currentParent);
-    this.nextNode = findAfter(this.currentParent, this.currentNode);
-  }
+  stepDown(): void {}
   countParagraph(): void {
     this.paragraphCount++;

[Survived] BlockStatement
printer-markdown/types/classes/badge-finder-state.ts:48:26
     this.currentNode = getFirstChild(this.currentParent);
     this.nextNode = findAfter(this.currentParent, this.currentNode);
   }
-  countParagraph(): void {
-    this.paragraphCount++;
-  }
+  countParagraph(): void {}
   complete(): void {
     this.lastBadge = this.mostRecentBadge;

[Survived] UpdateOperator
printer-markdown/types/classes/badge-finder-state.ts:49:5
     this.nextNode = findAfter(this.currentParent, this.currentNode);
   }
   countParagraph(): void {
-    this.paragraphCount++;
+    this.paragraphCount--;
   }
   complete(): void {

[Survived] BlockStatement
printer-markdown/types/classes/badge-finder-state.ts:51:20
   countParagraph(): void {
     this.paragraphCount++;
   }
-  complete(): void {
-    this.lastBadge = this.mostRecentBadge;
-    this.searchComplete = true;
-  }
+  complete(): void {}
 }
 

[Survived] BooleanLiteral
printer-markdown/types/classes/badge-finder-state.ts:53:27
   }
   complete(): void {
     this.lastBadge = this.mostRecentBadge;
-    this.searchComplete = true;
+    this.searchComplete = false;
   }
 }
