[Survived] BlockStatement
printer-markdown/types/classes/node-analysis.ts:13:46
   isSeparator: boolean;
   isBadge: boolean;
   isRoot: boolean;
-  constructor(node: Node, separator: string) {
-    (this.exists = Boolean(node)),
-      (this.isParagraph = is(node, "paragraph")),
-      (this.isSpace = test.isSpace(node)),
-      (this.isNewline = test.isNewline(node)),
-      (this.isSeparator = test.isSpecificText(node, separator)),
-      (this.isBadge = test.isBadge(node)),
-      (this.isRoot = test.isRoot(node));
-  }
+  constructor(node: Node, separator: string) {}
 }
 

[Survived] StringLiteral
printer-markdown/types/classes/node-analysis.ts:15:36
   isRoot: boolean;
   constructor(node: Node, separator: string) {
     (this.exists = Boolean(node)),
-      (this.isParagraph = is(node, "paragraph")),
+      (this.isParagraph = is(node, "")),
       (this.isSpace = test.isSpace(node)),
       (this.isNewline = test.isNewline(node)),
