[Survived] StringLiteral
src/contributions/provider-shields/index.ts:8:15
       badges: {
         "npm/v": {
           details: ":packageName",
-          to: ":packageRegistry",
+          to: "",
           display: "Version",
         },

[Survived] ObjectLiteral
src/contributions/provider-shields/index.ts:11:27
           to: ":packageRegistry",
           display: "Version",
         },
-        "github/license": {
-          details: ":user/:repo",
-          to: ":packageHomepage",
-          display: "License",
-        },
+        "github/license": {},
         "jsdelivr/npm": {
           details: ":period/:packageName",

[Survived] StringLiteral
src/contributions/provider-shields/index.ts:18:15
         },
         "jsdelivr/npm": {
           details: ":period/:packageName",
-          to: ":packageHomepage",
+          to: "",
           display: "Downloads",
         },

[Survived] StringLiteral
src/contributions/provider-shields/index.ts:23:15
         },
         "appveyor/build": {
           details: ":user/:repo",
-          to: "",
+          to: "Stryker was here!",
           display: "Build",
           variations: {

[Survived] ObjectLiteral
src/contributions/provider-shields/index.ts:31:31
             },
           },
         },
-        "appveyor/job/build": {
-          details: ":user/:repo/:job",
-          to: "",
-          display: "Job",
-          variations: {
-            branch: {
-              details: ":user/:repo/:job/:branch",
-            },
-          },
-        },
+        "appveyor/job/build": {},
         "appveyor/tests": {
           details: ":user/:repo",

[Survived] StringLiteral
src/contributions/provider-shields/index.ts:32:20
           },
         },
         "appveyor/job/build": {
-          details: ":user/:repo/:job",
+          details: "",
           to: "",
           display: "Job",

[Survived] StringLiteral
src/contributions/provider-shields/index.ts:47:24
           display: "Tests",
           variations: {
             branch: {
-              details: ":user/:repo/:branch",
+              details: "",
             },
             compact: {

[Survived] ObjectLiteral
src/contributions/provider-shields/index.ts:49:22
             branch: {
               details: ":user/:repo/:branch",
             },
-            compact: {
-              query: {
-                compact_message: true,
-              },
-            },
+            compact: {},
           },
         },

[Survived] BooleanLiteral
src/contributions/provider-shields/index.ts:51:34
             },
             compact: {
               query: {
-                compact_message: true,
+                compact_message: false,
               },
             },

[Survived] ObjectLiteral
src/contributions/provider-shields/index.ts:66:23
             },
           },
         },
-        "badge-roll": {
-          path: "badge/badges-rolled-white",
-          to: "https://github.com/agorischek/badge-roll",
-          display: "Badges",
-        },
+        "badge-roll": {},
         // /github/workflow/status/:user/:repo/:workflow
         "github/workflow/status": {

[Survived] StringLiteral
src/contributions/provider-shields/index.ts:68:15
         },
         "badge-roll": {
           path: "badge/badges-rolled-white",
-          to: "https://github.com/agorischek/badge-roll",
+          to: "",
           display: "Badges",
         },

[Survived] StringLiteral
src/contributions/provider-shields/index.ts:69:20
         "badge-roll": {
           path: "badge/badges-rolled-white",
           to: "https://github.com/agorischek/badge-roll",
-          display: "Badges",
+          display: "",
         },
         // /github/workflow/status/:user/:repo/:workflow

[Survived] ObjectLiteral
src/contributions/provider-shields/index.ts:72:35
           display: "Badges",
         },
         // /github/workflow/status/:user/:repo/:workflow
-        "github/workflow/status": {
-          details: ":user/:repo/:workflow",
-          to: "",
-          display: "Workflow",
-        },
+        "github/workflow/status": {},
       },
     },

[Survived] StringLiteral
src/contributions/provider-shields/index.ts:73:20
         },
         // /github/workflow/status/:user/:repo/:workflow
         "github/workflow/status": {
-          details: ":user/:repo/:workflow",
+          details: "",
           to: "",
           display: "Workflow",
