[Survived] ObjectLiteral
src/contributions/settings-default/index.ts:2:13
 export default {
-  settings: {
-    style: null,
-    provider: "shields",
-    printer: "markdown",
-    file: "./README.md",
-    separator: "space",
-    position: "below-title",
-  },
+  settings: {},
 };
 

[Survived] StringLiteral
src/contributions/settings-default/index.ts:7:16
     provider: "shields",
     printer: "markdown",
     file: "./README.md",
-    separator: "space",
+    separator: "",
     position: "below-title",
   },
