[Killed] BlockStatement
badge-roll/src/loaders/package-loader.ts:5:40
 
 import { Package } from "../types";
 
-export function loadPackage(): Package {
-  const packageDetails: Package = readPackageDetails.sync();
-  return packageDetails;
-}
+export function loadPackage(): Package {}
 
