[Killed] StringLiteral
badge-roll/src/options/config-locations.ts:1:32
-export const packageProperty = "badgeConfig";
+export const packageProperty = "";
 
 export const filePaths = [

[Killed] ArrayDeclaration
badge-roll/src/options/config-locations.ts:3:26
 export const packageProperty = "badgeConfig";
 
-export const filePaths = [
-  "package.json",
-  "badgeconfig.json",
-  "badgeconfig.yaml",
-  "badgeconfig.yml",
-];
+export const filePaths = [];
 
