[Killed] StringLiteral
badge-roll/src/options/contributions.ts:2:28
 export const contributions = {
-  about: ["about-package", "about-repo", "about-registry"],
+  about: ["about-package", "", "about-registry"],
   printers: ["printer-markdown"],
   providers: ["provider-shields"],

[Killed] StringLiteral
badge-roll/src/options/contributions.ts:2:42
 export const contributions = {
-  about: ["about-package", "about-repo", "about-registry"],
+  about: ["about-package", "about-repo", ""],
   printers: ["printer-markdown"],
   providers: ["provider-shields"],

[Killed] ArrayDeclaration
badge-roll/src/options/contributions.ts:4:14
 export const contributions = {
   about: ["about-package", "about-repo", "about-registry"],
   printers: ["printer-markdown"],
-  providers: ["provider-shields"],
+  providers: [],
   settings: ["settings-default"],
 };

[Killed] StringLiteral
badge-roll/src/options/contributions.ts:5:14
   about: ["about-package", "about-repo", "about-registry"],
   printers: ["printer-markdown"],
   providers: ["provider-shields"],
-  settings: ["settings-default"],
+  settings: [""],
 };
 
