[Killed] ObjectLiteral
badge-roll/src/schemas/config-schema.ts:8:40
 import { pluginsSchema } from "./plugins-schema";
 import { settingsSchema } from "./settings-schema";
 
-export const configSchema = Joi.object({
-  badges: badgesSchema,
-  about: aboutSchema,
-  settings: settingsSchema,
-  plugins: pluginsSchema,
-});
+export const configSchema = Joi.object({});
 
