[Killed] ObjectLiteral
badge-roll/src/schemas/settings-schema.ts:3:42
 import Joi from "joi";
 
-export const settingsSchema = Joi.object({
-  style: Joi.string(),
-  provider: Joi.string(),
-  position: Joi.string(),
-  separator: Joi.string(),
-});
+export const settingsSchema = Joi.object({});
 
