[Killed] BlockStatement
src/types/classes/about.ts:8:63
 export class About {
   [property: string]: string;
 
-  constructor(config: Config, contributions: ContributionSet) {
-    let about: About = config.about ? config.about : {};
-
-    const packageDetails = loadPackage();
-
-    const context: Context = {
-      package: packageDetails,
-    };
-
-    contributions.about.forEach((contribution) => {
-      about = contribution(about, context);
-    });
-
-    return about;
-  }
+  constructor(config: Config, contributions: ContributionSet) {}
 }
 

[Killed] BlockStatement
src/types/classes/about.ts:17:51
       package: packageDetails,
     };
 
-    contributions.about.forEach((contribution) => {
-      about = contribution(about, context);
-    });
+    contributions.about.forEach((contribution) => {});
 
     return about;
