[Killed] BlockStatement
src/types/classes/badge-section.ts:5:32
 
 export class BadgeSection {
   badges: Array<Badge>;
-  constructor(run: RunContext) {
-    const badges = run.badges.map(
-      (badge) => new Badge(badge, run.settings, run.about, run.providers)
-    );
-    this.badges = badges;
-  }
+  constructor(run: RunContext) {}
 }
 

[Killed] ArrowFunction
src/types/classes/badge-section.ts:7:7
   badges: Array<Badge>;
   constructor(run: RunContext) {
     const badges = run.badges.map(
-      (badge) => new Badge(badge, run.settings, run.about, run.providers)
+      () => undefined
     );
     this.badges = badges;
