[Killed] ConditionalExpression
src/types/classes/badge.ts:32:7
     providers: ProvidersDirectory
   ) {
     const badge: BadgeConfig =
-      typeof badgeConfig === "string" ? { id: badgeConfig } : badgeConfig;
+      true ? { id: badgeConfig } : badgeConfig;
 
     const about = combine(globalAbout, badge.about);

[Killed] ConditionalExpression
src/types/classes/badge.ts:32:7
     providers: ProvidersDirectory
   ) {
     const badge: BadgeConfig =
-      typeof badgeConfig === "string" ? { id: badgeConfig } : badgeConfig;
+      false ? { id: badgeConfig } : badgeConfig;
 
     const about = combine(globalAbout, badge.about);

[Killed] ConditionalExpression
src/types/classes/badge.ts:36:22
 
     const about = combine(globalAbout, badge.about);
     const id = badge.id;
-    const provider = badge.provider || settings.provider;
+    const provider = true;
     const style = badge.style || settings.style;
     const variation = badge.variation;

[Killed] ConditionalExpression
src/types/classes/badge.ts:36:22
 
     const about = combine(globalAbout, badge.about);
     const id = badge.id;
-    const provider = badge.provider || settings.provider;
+    const provider = false;
     const style = badge.style || settings.style;
     const variation = badge.variation;

[Killed] ConditionalExpression
src/types/classes/badge.ts:37:19
     const about = combine(globalAbout, badge.about);
     const id = badge.id;
     const provider = badge.provider || settings.provider;
-    const style = badge.style || settings.style;
+    const style = true;
     const variation = badge.variation;
 

[Killed] ConditionalExpression
src/types/classes/badge.ts:37:19
     const about = combine(globalAbout, badge.about);
     const id = badge.id;
     const provider = badge.provider || settings.provider;
-    const style = badge.style || settings.style;
+    const style = false;
     const variation = badge.variation;
 

[Killed] ConditionalExpression
src/types/classes/badge.ts:45:23
 
     const badgeSpec = new BadgeSpec(providerDefinition.badges[id], variation);
 
-    const badgePath = badgeSpec.path || id;
+    const badgePath = false;
     const to = new Path(badge.to || badgeSpec.to, about).evaluated;
     const display = badgeSpec.display || badge.display;

[Killed] ConditionalExpression
src/types/classes/badge.ts:45:23
 
     const badgeSpec = new BadgeSpec(providerDefinition.badges[id], variation);
 
-    const badgePath = badgeSpec.path || id;
+    const badgePath = true;
     const to = new Path(badge.to || badgeSpec.to, about).evaluated;
     const display = badgeSpec.display || badge.display;

[Killed] ConditionalExpression
src/types/classes/badge.ts:46:25
     const badgeSpec = new BadgeSpec(providerDefinition.badges[id], variation);
 
     const badgePath = badgeSpec.path || id;
-    const to = new Path(badge.to || badgeSpec.to, about).evaluated;
+    const to = new Path(false, about).evaluated;
     const display = badgeSpec.display || badge.display;
     const queryParams = combine(

[Killed] ConditionalExpression
src/types/classes/badge.ts:46:25
     const badgeSpec = new BadgeSpec(providerDefinition.badges[id], variation);
 
     const badgePath = badgeSpec.path || id;
-    const to = new Path(badge.to || badgeSpec.to, about).evaluated;
+    const to = new Path(true, about).evaluated;
     const display = badgeSpec.display || badge.display;
     const queryParams = combine(

[Killed] ConditionalExpression
src/types/classes/badge.ts:47:21
 
     const badgePath = badgeSpec.path || id;
     const to = new Path(badge.to || badgeSpec.to, about).evaluated;
-    const display = badgeSpec.display || badge.display;
+    const display = true;
     const queryParams = combine(
       badgeSpec.query,

[Killed] LogicalOperator
src/types/classes/badge.ts:47:21
 
     const badgePath = badgeSpec.path || id;
     const to = new Path(badge.to || badgeSpec.to, about).evaluated;
-    const display = badgeSpec.display || badge.display;
+    const display = badgeSpec.display && badge.display;
     const queryParams = combine(
       badgeSpec.query,

[Killed] ObjectLiteral
src/types/classes/badge.ts:51:15
     const queryParams = combine(
       badgeSpec.query,
       badge.query,
-      style ? { style: style } : null
+      style ? {} : null
     );
     const queryString = stringifyQuery(queryParams);

[Killed] ConditionalExpression
src/types/classes/badge.ts:55:21
     );
     const queryString = stringifyQuery(queryParams);
 
-    const details = badgeSpec.details || badge.details || null;
+    const details = true;
     const detailsPath = details ? new Path(details, about).evaluated : null;
 

[Killed] ConditionalExpression
src/types/classes/badge.ts:55:21
     );
     const queryString = stringifyQuery(queryParams);
 
-    const details = badgeSpec.details || badge.details || null;
+    const details = true || null;
     const detailsPath = details ? new Path(details, about).evaluated : null;
 

[Killed] StringLiteral
src/types/classes/badge.ts:61:17
     const url = concat(
       `${basePath}`,
       `/${badgePath}`,
-      details ? `/${detailsPath}` : "",
+      details ? `` : "",
       queryString ? `?${queryString}` : ""
     );

[Killed] StringLiteral
src/types/classes/badge.ts:62:21
       `${basePath}`,
       `/${badgePath}`,
       details ? `/${detailsPath}` : "",
-      queryString ? `?${queryString}` : ""
+      queryString ? `` : ""
     );
 
