[Killed] BlockStatement
src/types/classes/config.ts:10:36
   plugins?: Plugins;
   settings?: SettingsData;
 
-  constructor(configData?: Config) {
-    const config = configData || findConfig().config;
-    validateConfig(config);
-    return config;
-  }
+  constructor(configData?: Config) {}
 }
 

[Killed] ConditionalExpression
src/types/classes/config.ts:11:20
   settings?: SettingsData;
 
   constructor(configData?: Config) {
-    const config = configData || findConfig().config;
+    const config = false;
     validateConfig(config);
     return config;

[Killed] LogicalOperator
src/types/classes/config.ts:11:20
   settings?: SettingsData;
 
   constructor(configData?: Config) {
-    const config = configData || findConfig().config;
+    const config = configData && findConfig().config;
     validateConfig(config);
     return config;
