[Killed] BlockStatement
src/types/classes/contribution-set.ts:16:17
   providers: Array<ProvidersContribution>;
   settings: Array<SettingsContribution>;
 
-  constructor() {
-    this.about = contributions.about.map((name: string) => {
-      return loadModule(name, true).about;
-    });
-    this.printers = contributions.printers.map((name: string) => {
-      return loadModule(name, true).printers;
-    });
-    this.providers = contributions.providers.map((name: string) => {
-      return loadModule(name, true).providers;
-    });
-    this.settings = contributions.settings.map((name: string) => {
-      return loadModule(name, true).settings;
-    });
-  }
+  constructor() {}
 }
 

[Killed] BlockStatement
src/types/classes/contribution-set.ts:17:60
   settings: Array<SettingsContribution>;
 
   constructor() {
-    this.about = contributions.about.map((name: string) => {
-      return loadModule(name, true).about;
-    });
+    this.about = contributions.about.map((name: string) => {});
     this.printers = contributions.printers.map((name: string) => {
       return loadModule(name, true).printers;

[Killed] BooleanLiteral
src/types/classes/contribution-set.ts:18:31
 
   constructor() {
     this.about = contributions.about.map((name: string) => {
-      return loadModule(name, true).about;
+      return loadModule(name, false).about;
     });
     this.printers = contributions.printers.map((name: string) => {

[Killed] BlockStatement
src/types/classes/contribution-set.ts:20:66
     this.about = contributions.about.map((name: string) => {
       return loadModule(name, true).about;
     });
-    this.printers = contributions.printers.map((name: string) => {
-      return loadModule(name, true).printers;
-    });
+    this.printers = contributions.printers.map((name: string) => {});
     this.providers = contributions.providers.map((name: string) => {
       return loadModule(name, true).providers;

[Killed] BooleanLiteral
src/types/classes/contribution-set.ts:21:31
       return loadModule(name, true).about;
     });
     this.printers = contributions.printers.map((name: string) => {
-      return loadModule(name, true).printers;
+      return loadModule(name, false).printers;
     });
     this.providers = contributions.providers.map((name: string) => {

[Killed] BlockStatement
src/types/classes/contribution-set.ts:23:68
     this.printers = contributions.printers.map((name: string) => {
       return loadModule(name, true).printers;
     });
-    this.providers = contributions.providers.map((name: string) => {
-      return loadModule(name, true).providers;
-    });
+    this.providers = contributions.providers.map((name: string) => {});
     this.settings = contributions.settings.map((name: string) => {
       return loadModule(name, true).settings;

[Killed] BooleanLiteral
src/types/classes/contribution-set.ts:24:31
       return loadModule(name, true).printers;
     });
     this.providers = contributions.providers.map((name: string) => {
-      return loadModule(name, true).providers;
+      return loadModule(name, false).providers;
     });
     this.settings = contributions.settings.map((name: string) => {

[Killed] BlockStatement
src/types/classes/contribution-set.ts:26:66
     this.providers = contributions.providers.map((name: string) => {
       return loadModule(name, true).providers;
     });
-    this.settings = contributions.settings.map((name: string) => {
-      return loadModule(name, true).settings;
-    });
+    this.settings = contributions.settings.map((name: string) => {});
   }
 }

[Killed] BooleanLiteral
src/types/classes/contribution-set.ts:27:31
       return loadModule(name, true).providers;
     });
     this.settings = contributions.settings.map((name: string) => {
-      return loadModule(name, true).settings;
+      return loadModule(name, false).settings;
     });
   }
