[Killed] BlockStatement
src/types/classes/path.ts:7:43
   segments: Array<PathSegment>;
   original: string;
   evaluated: string;
-  constructor(path: string, about: About) {
-    this.original = path;
-    this.segments = parsePath(path);
-    this.evaluated = evaluatePath(this.segments, about);
-  }
+  constructor(path: string, about: About) {}
 }
 

[Killed] BlockStatement
src/types/classes/path.ts:14:78
   }
 }
 
-export function evaluatePath(path: Array<PathSegment>, about: About): string {
-  const evaluated = path.reduce((acc: string, segment: PathSegment) => {
-    if (segment.kind === "literal") {
-      if (acc === "") return `${segment.name}`;
-      else return `${acc}/${segment.name}`;
-    } else if (segment.kind === "variable") {
-      if (acc === "") return `${about[segment.name]}`;
-      else return `${acc}/${about[segment.name]}`;
-    }
-  }, "");
-  return evaluated;
-}
+export function evaluatePath(path: Array<PathSegment>, about: About): string {}
 
 export function parsePath(unparsed: string): Array<PathSegment> {

[Killed] BlockStatement
src/types/classes/path.ts:15:72
 }
 
 export function evaluatePath(path: Array<PathSegment>, about: About): string {
-  const evaluated = path.reduce((acc: string, segment: PathSegment) => {
-    if (segment.kind === "literal") {
-      if (acc === "") return `${segment.name}`;
-      else return `${acc}/${segment.name}`;
-    } else if (segment.kind === "variable") {
-      if (acc === "") return `${about[segment.name]}`;
-      else return `${acc}/${about[segment.name]}`;
-    }
-  }, "");
+  const evaluated = path.reduce((acc: string, segment: PathSegment) => {}, "");
   return evaluated;
 }

[Killed] ConditionalExpression
src/types/classes/path.ts:16:9
 
 export function evaluatePath(path: Array<PathSegment>, about: About): string {
   const evaluated = path.reduce((acc: string, segment: PathSegment) => {
-    if (segment.kind === "literal") {
+    if (false) {
       if (acc === "") return `${segment.name}`;
       else return `${acc}/${segment.name}`;

[Killed] ConditionalExpression
src/types/classes/path.ts:16:9
 
 export function evaluatePath(path: Array<PathSegment>, about: About): string {
   const evaluated = path.reduce((acc: string, segment: PathSegment) => {
-    if (segment.kind === "literal") {
+    if (true) {
       if (acc === "") return `${segment.name}`;
       else return `${acc}/${segment.name}`;

[Killed] ConditionalExpression
src/types/classes/path.ts:17:11
 export function evaluatePath(path: Array<PathSegment>, about: About): string {
   const evaluated = path.reduce((acc: string, segment: PathSegment) => {
     if (segment.kind === "literal") {
-      if (acc === "") return `${segment.name}`;
+      if (false) return `${segment.name}`;
       else return `${acc}/${segment.name}`;
     } else if (segment.kind === "variable") {

[Killed] EqualityOperator
src/types/classes/path.ts:17:11
 export function evaluatePath(path: Array<PathSegment>, about: About): string {
   const evaluated = path.reduce((acc: string, segment: PathSegment) => {
     if (segment.kind === "literal") {
-      if (acc === "") return `${segment.name}`;
+      if (acc !== "") return `${segment.name}`;
       else return `${acc}/${segment.name}`;
     } else if (segment.kind === "variable") {

[Killed] StringLiteral
src/types/classes/path.ts:18:19
   const evaluated = path.reduce((acc: string, segment: PathSegment) => {
     if (segment.kind === "literal") {
       if (acc === "") return `${segment.name}`;
-      else return `${acc}/${segment.name}`;
+      else return ``;
     } else if (segment.kind === "variable") {
       if (acc === "") return `${about[segment.name]}`;

[Killed] BlockStatement
src/types/classes/path.ts:19:45
     if (segment.kind === "literal") {
       if (acc === "") return `${segment.name}`;
       else return `${acc}/${segment.name}`;
-    } else if (segment.kind === "variable") {
-      if (acc === "") return `${about[segment.name]}`;
-      else return `${acc}/${about[segment.name]}`;
-    }
+    } else if (segment.kind === "variable") {}
   }, "");
   return evaluated;

[Killed] EqualityOperator
src/types/classes/path.ts:19:16
     if (segment.kind === "literal") {
       if (acc === "") return `${segment.name}`;
       else return `${acc}/${segment.name}`;
-    } else if (segment.kind === "variable") {
+    } else if (segment.kind !== "variable") {
       if (acc === "") return `${about[segment.name]}`;
       else return `${acc}/${about[segment.name]}`;

[Killed] ConditionalExpression
src/types/classes/path.ts:20:11
       if (acc === "") return `${segment.name}`;
       else return `${acc}/${segment.name}`;
     } else if (segment.kind === "variable") {
-      if (acc === "") return `${about[segment.name]}`;
+      if (true) return `${about[segment.name]}`;
       else return `${acc}/${about[segment.name]}`;
     }

[Killed] EqualityOperator
src/types/classes/path.ts:20:11
       if (acc === "") return `${segment.name}`;
       else return `${acc}/${segment.name}`;
     } else if (segment.kind === "variable") {
-      if (acc === "") return `${about[segment.name]}`;
+      if (acc !== "") return `${about[segment.name]}`;
       else return `${acc}/${about[segment.name]}`;
     }

[Killed] StringLiteral
src/types/classes/path.ts:21:19
       else return `${acc}/${segment.name}`;
     } else if (segment.kind === "variable") {
       if (acc === "") return `${about[segment.name]}`;
-      else return `${acc}/${about[segment.name]}`;
+      else return ``;
     }
   }, "");

[Killed] BlockStatement
src/types/classes/path.ts:27:65
   return evaluated;
 }
 
-export function parsePath(unparsed: string): Array<PathSegment> {
-  const split = unparsed.split("/");
-  const path: Array<PathSegment> = split.map((segment) => {
-    const matched = segment.match(/^:(.+)/);
-    if (matched) return { kind: "variable", name: matched[1] };
-    else return { kind: "literal", name: segment };
-  });
-  return path;
-}
+export function parsePath(unparsed: string): Array<PathSegment> {}
 

[Killed] StringLiteral
src/types/classes/path.ts:28:32
 }
 
 export function parsePath(unparsed: string): Array<PathSegment> {
-  const split = unparsed.split("/");
+  const split = unparsed.split("");
   const path: Array<PathSegment> = split.map((segment) => {
     const matched = segment.match(/^:(.+)/);

[Killed] BlockStatement
src/types/classes/path.ts:29:59
 
 export function parsePath(unparsed: string): Array<PathSegment> {
   const split = unparsed.split("/");
-  const path: Array<PathSegment> = split.map((segment) => {
-    const matched = segment.match(/^:(.+)/);
-    if (matched) return { kind: "variable", name: matched[1] };
-    else return { kind: "literal", name: segment };
-  });
+  const path: Array<PathSegment> = split.map((segment) => {});
   return path;
 }

[Killed] Regex
src/types/classes/path.ts:30:35
 export function parsePath(unparsed: string): Array<PathSegment> {
   const split = unparsed.split("/");
   const path: Array<PathSegment> = split.map((segment) => {
-    const matched = segment.match(/^:(.+)/);
+    const matched = segment.match(/^:(.)/);
     if (matched) return { kind: "variable", name: matched[1] };
     else return { kind: "literal", name: segment };

[Survived] Regex
src/types/classes/path.ts:30:35
 export function parsePath(unparsed: string): Array<PathSegment> {
   const split = unparsed.split("/");
   const path: Array<PathSegment> = split.map((segment) => {
-    const matched = segment.match(/^:(.+)/);
+    const matched = segment.match(/:(.+)/);
     if (matched) return { kind: "variable", name: matched[1] };
     else return { kind: "literal", name: segment };

[Killed] ConditionalExpression
src/types/classes/path.ts:31:9
   const split = unparsed.split("/");
   const path: Array<PathSegment> = split.map((segment) => {
     const matched = segment.match(/^:(.+)/);
-    if (matched) return { kind: "variable", name: matched[1] };
+    if (true) return { kind: "variable", name: matched[1] };
     else return { kind: "literal", name: segment };
   });

[Killed] ConditionalExpression
src/types/classes/path.ts:31:9
   const split = unparsed.split("/");
   const path: Array<PathSegment> = split.map((segment) => {
     const matched = segment.match(/^:(.+)/);
-    if (matched) return { kind: "variable", name: matched[1] };
+    if (false) return { kind: "variable", name: matched[1] };
     else return { kind: "literal", name: segment };
   });
