[Killed] BlockStatement
src/types/classes/printer-list.ts:12:47
     target?: string
   ) => string;
 
-  constructor(contributions: ContributionSet) {
-    const printers = contributions.printers.reduce(
-      (printers: PrinterList, contribution) => {
-        return merge(printers, contribution);
-      },
-      {}
-    );
-
-    return printers;
-  }
+  constructor(contributions: ContributionSet) {}
 }
 

[Killed] BlockStatement
src/types/classes/printer-list.ts:14:48
 
   constructor(contributions: ContributionSet) {
     const printers = contributions.printers.reduce(
-      (printers: PrinterList, contribution) => {
-        return merge(printers, contribution);
-      },
+      (printers: PrinterList, contribution) => {},
       {}
     );
