[Killed] BlockStatement
src/types/classes/providers-directory.ts:8:47
 export class ProvidersDirectory {
   [provider: string]: ProviderDefinition;
 
-  constructor(contributions: ContributionSet) {
-    const providers = contributions.providers.reduce(
-      (providers: ProvidersDirectory, contribution) => {
-        return merge(providers, contribution);
-      },
-      {}
-    );
-
-    return providers;
-  }
+  constructor(contributions: ContributionSet) {}
 }
 

[Killed] BlockStatement
src/types/classes/providers-directory.ts:10:56
 
   constructor(contributions: ContributionSet) {
     const providers = contributions.providers.reduce(
-      (providers: ProvidersDirectory, contribution) => {
-        return merge(providers, contribution);
-      },
+      (providers: ProvidersDirectory, contribution) => {},
       {}
     );
