[Killed] BlockStatement
src/types/classes/run-context.ts:17:36
   providers: ProvidersDirectory;
   printers: PrinterList;
   badges: Array<BadgeConfig>;
-  constructor(configData?: Config) {
-    const config = new Config(configData);
-    const contributions = new ContributionSet();
-    const settings = new Settings(config, contributions);
-    const about = new About(config, contributions);
-    const providers = new ProvidersDirectory(contributions);
-    const printers = new PrinterList(contributions);
-    const badges = config.badges;
-    return {
-      about,
-      settings,
-      providers,
-      printers,
-      badges,
-    };
-  }
+  constructor(configData?: Config) {}
 }
 
