[Killed] BlockStatement
src/types/classes/run.ts:8:49
   modified: string;
   filePath?: string;
   matches: boolean;
-  constructor(source?: string, config?: Config) {
-    const run = new RunContext(config);
-    const target = new Target(run.settings, source);
-    const printer = new Printer(run.printers, target.printer);
-    const section = new BadgeSection(run);
-    const markup = printer.print(
-      section.badges,
-      run.settings,
-      target.originalContent
-    );
-    const matches = target.originalContent === markup;
-    return {
-      original: target.originalContent,
-      modified: markup,
-      filePath: target.path,
-      matches: matches,
-    };
-  }
+  constructor(source?: string, config?: Config) {}
 }
 

[Killed] ConditionalExpression
src/types/classes/run.ts:18:21
       run.settings,
       target.originalContent
     );
-    const matches = target.originalContent === markup;
+    const matches = true;
     return {
       original: target.originalContent,

[Killed] EqualityOperator
src/types/classes/run.ts:18:21
       run.settings,
       target.originalContent
     );
-    const matches = target.originalContent === markup;
+    const matches = target.originalContent !== markup;
     return {
       original: target.originalContent,
