[Killed] BlockStatement
src/types/classes/settings.ts:14:63
   baseUrl?: string;
   separator?: string;
 
-  constructor(config: Config, contributions: ContributionSet) {
-    const contributedSettings = contributions.settings.reduce(
-      (settings: SettingsData, contribution) => {
-        return merge(settings, contribution);
-      },
-      {}
-    );
-    const settings = merge(contributedSettings, config.settings);
-    return settings;
-  }
+  constructor(config: Config, contributions: ContributionSet) {}
 }
 

[Killed] BlockStatement
src/types/classes/settings.ts:16:49
 
   constructor(config: Config, contributions: ContributionSet) {
     const contributedSettings = contributions.settings.reduce(
-      (settings: SettingsData, contribution) => {
-        return merge(settings, contribution);
-      },
+      (settings: SettingsData, contribution) => {},
       {}
     );
