[Killed] BlockStatement
badge-roll/src/utilities/combine.ts:5:22
 
 export function combine<T>(
   ...objects: Array<Record<string, T>>
-): Record<string, T> {
-  const combined = merge({}, ...objects);
-  return combined;
-}
+): Record<string, T> {}
 
