[Killed] BlockStatement
badge-roll/src/utilities/is-last.ts:1:71
-export function isLast(index: number, array: Array<unknown>): boolean {
-  return index === array.length - 1;
-}
+export function isLast(index: number, array: Array<unknown>): boolean {}
 

[Killed] EqualityOperator
badge-roll/src/utilities/is-last.ts:2:10
 export function isLast(index: number, array: Array<unknown>): boolean {
-  return index === array.length - 1;
+  return index !== array.length - 1;
 }
 

[Killed] ConditionalExpression
badge-roll/src/utilities/is-last.ts:2:10
 export function isLast(index: number, array: Array<unknown>): boolean {
-  return index === array.length - 1;
+  return false;
 }
 
