[Killed] BlockStatement
badge-roll/src/utilities/stringify-query.ts:3:66
 import { QueryParams } from "../types";
 
-export function stringifyQuery(queryParams: QueryParams): string {
-  return Object.keys(queryParams).reduce((acc, key) => {
-    const value = queryParams[key];
-    const stringified = value === true ? key : `${key}=${value}`;
-    return acc ? `${acc}&${stringified}` : `${stringified}`;
-  }, "");
-}
+export function stringifyQuery(queryParams: QueryParams): string {}
 

[Killed] BlockStatement
badge-roll/src/utilities/stringify-query.ts:4:56
 import { QueryParams } from "../types";
 
 export function stringifyQuery(queryParams: QueryParams): string {
-  return Object.keys(queryParams).reduce((acc, key) => {
-    const value = queryParams[key];
-    const stringified = value === true ? key : `${key}=${value}`;
-    return acc ? `${acc}&${stringified}` : `${stringified}`;
-  }, "");
+  return Object.keys(queryParams).reduce((acc, key) => {}, "");
 }
 

[Killed] EqualityOperator
badge-roll/src/utilities/stringify-query.ts:6:25
 export function stringifyQuery(queryParams: QueryParams): string {
   return Object.keys(queryParams).reduce((acc, key) => {
     const value = queryParams[key];
-    const stringified = value === true ? key : `${key}=${value}`;
+    const stringified = value !== true ? key : `${key}=${value}`;
     return acc ? `${acc}&${stringified}` : `${stringified}`;
   }, "");

[Killed] ConditionalExpression
badge-roll/src/utilities/stringify-query.ts:6:25
 export function stringifyQuery(queryParams: QueryParams): string {
   return Object.keys(queryParams).reduce((acc, key) => {
     const value = queryParams[key];
-    const stringified = value === true ? key : `${key}=${value}`;
+    const stringified = true ? key : `${key}=${value}`;
     return acc ? `${acc}&${stringified}` : `${stringified}`;
   }, "");

[Killed] StringLiteral
badge-roll/src/utilities/stringify-query.ts:7:44
   return Object.keys(queryParams).reduce((acc, key) => {
     const value = queryParams[key];
     const stringified = value === true ? key : `${key}=${value}`;
-    return acc ? `${acc}&${stringified}` : `${stringified}`;
+    return acc ? `${acc}&${stringified}` : ``;
   }, "");
 }

[Killed] StringLiteral
badge-roll/src/utilities/stringify-query.ts:7:18
   return Object.keys(queryParams).reduce((acc, key) => {
     const value = queryParams[key];
     const stringified = value === true ? key : `${key}=${value}`;
-    return acc ? `${acc}&${stringified}` : `${stringified}`;
+    return acc ? `` : `${stringified}`;
   }, "");
 }
